app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save